Repository: 84000/data-translation-memory
Catalog: toh231-v1.tmx
Source language: bo
Languages: en

source: འདྲི་བ་ཐམས་ཅད་ཀྱི་ལུང་བསྟན་པས་ཚིམ་པར་བྱེད་དོ། །མཐའ་དང་དབུང་མེད་པའི་རྫུ་འཕྲུལ་ལ་མཁས་པར་བྱེད་དོ།
en: Responding to all questions, they satisfy others and bring them expertise in miraculous displays beyond edges and center.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་གྱི་དཀྱིལ་འཁོར་དཔག་བསམ་གྱི་ཤིང་ལས་ཤིན་ཏུ་བྱུང་བའི་ཆོས་ཀྱི་གཏམ་ཡང་དག་པར་གདོན་མི་ཟ་བའི་མེ་ཏོག་ཡིད་དུ་འོང་བའི་ཆར་རྟག་ཏུ་མངོན་པར་འབེབས་པ་ཡིན་ནོ།
en: Thus, bodhisattvas bring down a continuous and delightful flower rain of the true and indisputable Dharma from wish-fulfilling trees upon the circles of their retinue.

source: ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གྲངས་མེད་པར་དཀར་པོའི་དཀྱིལ་འཁོར་ཡོངས་སུ་བསགས་པ་
en: “In what way, you may wonder, do bodhisattvas use their virtuous environment, which they have accumulated over incalculable eons

source: ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་ཐར་པ་དང་། གཟུངས་ཀྱི་སྒོ་རྒྱ་མཚོ་དང་། རི་རབ་དང་། འོད་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། ཆོས་ཀྱི་ཚུལ་དང་། ནགས་ཚལ་དང་། ཁང་པ་དང་། དགེ་བའི་ཁོར་ཡུག་གི་རི་ལ་སོགས་པས་ཡོངས་སུ་བསྐོར་བའི་སེམས་ཅན་གྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་གདུལ་བ་ཡོངས་སུ་སྨིན་པ་མང་པོ་ཡང་དག་པར་གནས་པ།
en: which contains an ocean of gateways to absorptions, liberations, and retentions, as well as a central mountain, light, moon, sun, Dharma ways, forests, houses, and surrounding mountains of virtue, to tame and ripen their retinues of many beings?

source: བླ་ན་མེད་ཅིང་ལུས་མེད་པའི་གནས་འཕོ་བར་འཇིག་པའི་ཡེ་ཤེས་ཀྱི་རླུང་གི་དཀྱིལ་འཁོར་རབ་ཏུ་གཏོང་བ་ཡིན་ཞེ་ན།
en: And how do they blow the destructive wind of wisdom, which is unsurpassed and transfers beings to the realms where there are no physical bodies?

source: བསྐལ་པའི་མཐར་ཐུག་སྟེ། འཇིག་རྟེན་གྱི་ཁམས་འཇིག་པར་འགྱུར་བའི་དུས་ན་གང་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་བྱེ་བ་
en: At the end of an eon, when the great trichiliocosm is destroyed,

source: ཁྲག་ཁྲིག་བརྒྱ་སྟོང་རི་རབ་དང་། ཁོར་ཡུག་རི་དང་། རྒྱ་མཚོ་ལ་སོགས་པར་བཅས་པ་ཀུན་ནས་འཇིག་ཅིང་རྣམ་པར་འཐོར་བ་དང་།
en: it tears apart and scatters a hundred quintillion things, including the central mountain, the surrounding rings of mountains, and the oceans.

source: རྨེག་མེད་པར་བྱེད་ཅིང་ནམ་མཁའི་རང་བཞིན་དུ་བྱེད་པ་དེ་ལྟ་བུའི་སྟོབས་ཀྱི་ཤུགས་ཐོགས་པ་མེད་པར་ལྡང་ངོ་།
en: Completely obliterating them all, it turns them into the nature of space. Such is the unimpeded force with which the wind rises.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ཡང་བསྐལ་པ་མང་པོར་ཚོགས་བསགས་པའི་སེམས་ཅན་བསོད་ནམས་དང་། ཡེ་ཤེས་སྣ་ཚོགས་རྣམ་པར་བཀོད་པའི་རི་མཐོན་པོ་དང་ལྡན་པ་རྣམས་ལ་བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཀྱི་ཤུགས་དང་། རྫུ་འཕྲུལ་དང་། རྣམ་པར་འཕྲུལ་པ་ཆེན་པོ་ཡོངས་སུ་བསྟན་པ་དང་།
en: Noble son, the wind-like bodhisattvas similarly blow on the lofty mountains of the merit and wisdom of those sentient beings that have gathered the accumulations throughout many eons, thus revealing their powers, miracles, and great emanations.

source: ཆོས་ཀྱི་འཁོར་ལོ་ཐོགས་པ་མེད་པར་རབ་ཏུ་བསྐོར་བའི་སྒྲ་སྐད་ཀྱི་དབྱངས་རབ་ཏུ་བསྒྲགས་པས་ཆོས་ཀྱི་ཕུང་པོའི་རླུང་གི་དཀྱིལ་འཁོར་གང་གིས་འདུལ་བ་ཆོས་སྣང་བའི་ལྷག་མཐོང་དམ་པ་དང་ལྡན་པ།
en: They let the tune of the unhindered turning of the wheel of Dharma resound, thereby causing those who need training to gain the light of special insight.

source: བཟོད་པར་མི་ནུས་པའི་འདུ་བྱེད་ཀྱི་སྟོབས་ཐམས་ཅད་མཉམ་པར་གཞོག་པ། ཚུལ་བཞིན་ཡིད་ལ་བྱས་ནས། ཡང་དག་པར་སེམས་ནང་དུ་གནས་པའི་
en: Crushing the power of intolerable formations and fostering correct mental engagement, they bring about the correct inner abiding of the mind.

source: ཏིང་ངེ་འཛིན་ཕུན་སུམ་ཚོགས་པ་ལ་བརྟེན་ཏེ། སྲིད་པ་དང་། ཕུང་པོ་དང་། ཁམས་དང་། སྐྱེ་མཆེད་ཀྱི་འདུ་བྱེད་ཀྱི་ལུས་ཐམས་ཅད་བཤིག་ཅིང་རྣམ་པར་གཏོར་ཏེ་
en: Based on such excellent absorption, they crush and scatter all bodies comprised of existence, aggregates, elements, and sense sources.

source: ལུས་མེད་པར་བྱས་ནས་ཡང་དག་པ་མ་ཡིན་པ་ཡོངས་སུ་བརྟགས་པ་རྣམ་པར་བཤིག་སྟེ། འཇིག་རྟེན་ཐམས་ཅད་ལས་ཡོངས་སུ་འདས་པ་བསམ་གྱིས་མི་ཁྱབ་ཅིང་གཟུགས་མེད་པའི་བསོད་ནམས་ཕུན་སུམ་ཚོགས་པ་དང་།
en: Having annihilated all bodies, they crush incorrect thinking and bring about the inconceivable, complete transcendence of the world and the excellent merit without form.

source: གཟུགས་ཐམས་ཅད་ཡོངས་སུ་བསྟན་པ་རྣམ་པར་བཤིག་པས་གནས་གྱུར་པ་རྣམ་པར་དག་པ་ཕྱི་མའི་མཐའི་མུར་ཐུག་པར་གནས་པ། རྣམ་པ་ཐམས་ཅད་དུ་མཐའ་དང་བྲལ་བ་རྣམས་ཐོབ་པར་བྱེད་པ་དེ་ལྟ་བུ་ཀུན་ནས་རབ་ཏུ་གཏོང་སྟེ།
en: Through the destruction of these forms, they cause a pure transformation that remains until the end of time, being beyond center and edge.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གྲངས་མེད་པར་དཀར་པོའི་དཀྱིལ་འཁོར་ཡོངས་སུ་བསགས་པ། ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་ཐར་པ་དང་། གཟུངས་ཀྱི་སྒོ་རྒྱ་མཚོ་དང་། རི་རབ་དང་། འོད་དང་། ཟླ་བ་དང་། ཉི་མ་དང་། ཆོས་ཀྱི་ཚུལ་དང་། ནགས་ཚལ་དང་། ཁང་པ་དང་། དགེ་བའི་ཁོར་ཡུག་རི་ལ་སོགས་པས་ཡོངས་སུ་བསྐོར་བའི་སེམས་ཅན་གྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་གདུལ་བ་ཡོངས་སུ་སྨིན་པ་མང་པོ་ཡང་དག་པར་གནས་པ། བླ་ན་མེད་ཅིང་ལུས་མེད་པའི་གནས་འཕོ་བ་དང་། འཇིག་པའི་ཡེ་ཤེས་ཀྱི་རླུང་གི་དཀྱིལ་འཁོར་རབ་ཏུ་གཏོང་བ་ཡིན་ཏེ། རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་རླུང་མར་ལྟ་བུ་རྣམས་ཡིན་ནོ།
en: Noble son, thus bodhisattvas cause their virtuous environment, which has been accumulated throughout incalculable eons and contains an ocean of absorptions, liberations, and retentions, as well as a central mountain, light, moon, sun, Dharma ways, forests, houses, and virtuous surrounding mountains, to manifest within the environment of sentient beings who cycle in existence. In this way they guide them, mature them, and transfer them to the unsurpassable state beyond a body. This is how they blow the wind of destructive wisdom. Noble son, bodhisattvas possessing these ten qualities are similar to wind.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: At this point the bodhisattva Sarva­nīvaraṇa­viṣkam­bhin addressed the Blessed One:

source: ཨ་ལ་ལ་དེ་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་ཞིང་སེམས་ཅན་རླབས་པོ་ཆེ་རྣམས་ཡོངས་སུ་ཚིམ་པར་འགྱུར་བའི་ཆོས་ཀྱི་ཚུལ་བཅུ་པོ་འདི་བསྟན་པ།
en: “Wonderful! The Blessed One has taught these ten Dharma ways that are supreme and satisfy the profusion of sentient beings.

source: བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ། །བདེ་བར་གཤེགས་པ་ངོ་མཚར་ཏོ།
en: O Blessed One, how marvelous! O Thus-Gone One, how marvelous!

source: བཅོམ་ལྡན་འདས་ལྷ་དང་མི་གང་ལ་ལ་ཆོས་འདི་དག་ལ་མོས་ཤིང་ནན་ཏན་བགྱིད་ན་དེ་དག་ཐམས་ཅད་ཇི་སྐད་དུ་གསུངས་པའི་ཕུན་སུམ་ཚོགས་པ་བདེ་བ་དང་བཅས་པ་ཡིད་བདེ་བ་དང་བཅས་པར་ཐོབ་པར་འགྱུར་ཏེ།
en: Blessed One, any god or human being who becomes inspired by this teaching and pursues it will attain the happiness that results from the perfections you have just explained.

source: བརྒྱ་བྱིན་དང་། ཚངས་པ་དང་། འཇིག་རྟེན་སྐྱོང་བ་ལ་སོགས་པ་ཞིག་བགྱིད་ནའང་གཞན་གྱི་དོན་ལ་གཞོལ་ཞིང་
en: Even if they should become Śakra, Brahmā, or a guardian of the world, they will still remain committed to the welfare of others.

source: ཚེ་འདི་དང་། ཚེ་རབས་གཞན་གྱི་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་ཀྱང་འཐོབ་པར་འགྱུར་རོ།
en: Thus they will attain all excellences in this and all future lives.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ།
en: “Noble son, that is correct,” said the Blessed One. “So it is.

source: སེམས་ཅན་གང་དེ་ལྟ་བུའི་ཆོས་རྣམས་ལ་ནན་ཏན་དུ་བྱེད་པ་དེ་དག་ནི་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ་དང་།
en: Anyone who pursues these teachings will be truly elevated above the entire world,

source: ཀུན་ཏུ་རྣམ་པར་བལྟས་པ་དང་། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་སྤངས་པ་དང་། དགེ་བའི་ཆོས་ཐམས་ཅད་དང་ལྡན་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་རྟེན་དུ་འགྱུར་རོ།
en: respected in all regards, free of all unvirtuous qualities, in possession of all virtuous qualities, and will turn into a support for the entire world.

source: གང་སྤོང་བའི་སྐྱེས་བུ་གླེན་པ་དེ་དག་ནི་མུན་པ་ནས་མུན་པར་གཞོལ་བ་སྟེ། སྡུག་བསྔལ་ཐམས་ཅད་ལ་རྟེན་པའོ།
en: The fools who discard these teachings will roam in continuous darkness, and will meet only with suffering.

source: ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་མྱ་ངན་དུ་བྱ་བའོ།།
en: The world with its gods, humans, and demigods will only bring them pain.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are similar to space.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲི་མ་མེད་པ་རྣམས་ཡིན། མ་ཆགས་པ་རྣམས་ཡིན། ཞི་བ་རྣམས་ཡིན། ཤེས་རབ་མཐའ་ཡས་པ་རྣམས་ཡིན། ཡེ་ཤེས་མཐའ་ཡས་པ་རྣམས་ཡིན། ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་སོང་བ་རྣམས་ཡིན། ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའི་དབྱིངས་ཀྱི་ངོ་བོ་ཉིད་དུ་མོས་པ་རྣམས་ཡིན། སོ་སོར་མི་རྟེན་པ་རྣམས་ཡིན། མཚན་མའི་སྤྱོད་ཡུལ་ལས་འདས་པ་རྣམས་ཡིན། རྟོག་གེའི་སྤྱོད་ཡུལ་ལས་འདས་པ་རྣམས་ཡིན་ཏེ། རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are stainlessness, nonattachment, peace, infinite insight, infinite wisdom, accord with the sameness of the realm of phenomena, conceiving of all phenomena as being of the nature of the field of space, absence of individual supports, transcendence of the sphere of marks, and transcendence of the logicians’ sphere of engagement. Noble son, bodhisattvas possessing ten such qualities are similar to space.

source: རིགས་ཀྱི་བུ་གཞན་ཡང་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ།
en: “Noble son, furthermore, bodhisattvas possessing another tenfold set of qualities are similar to space.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡིད་དུ་འོང་བ་དང་། ཡིད་དུ་མི་འོང་བའི་གཟུགས་རྣམས་ལ་ཆགས་པར་ཡང་མི་འགྱུར། ཁོང་ཁྲོ་བར་ཡང་མི་འགྱུར་བ་དང་། ཡིད་དུ་འོང་བ་དང་ཡིད་དུ་མི་འོང་བའི་སྒྲ་རྣམས་དང་། དྲི་རྣམས་དང་། རོ་རྣམས་དང་། རེག་བྱ་རྣམས་དང་། ཡིད་དུ་འོང་བ་དང་ཡིད་དུ་མི་འོང་བའི་ཆོས་རྣམས་ལ་ཆགས་པར་ཡང་མི་འགྱུར། ཁོང་ཁྲོ་བར་ཡང་མི་འགྱུར་བ་དང་། རྙེད་པ་དང་། མ་རྙེད་པ་དང་། བདེ་བ་དང་སྡུག་བསྔལ་བ་དང་། གྲགས་པ་དང་མ་གྲགས་པ་དང་། བསྟོད་པ་དང་སྨད་པས་ཆགས་པར་ཡང་མི་འགྱུར། ཁོང་ཁྲོ་བར་ཡང་མི་འགྱུར་བ་སྟེ། རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའ་དང་མཚུངས་པ་རྣམས་ཡིན་ནོ།
en: What are those ten? They are freedom from attachment and aversion with respect to pleasant and unpleasant forms, or in relation to pleasant and unpleasant sounds, smells, tastes, textures, and mental phenomena. Furthermore, they are freedom from attachment and aversion in relation to gain and loss, pleasure and pain, fame and obscurity, and praise and blame. Noble son, bodhisattvas possessing these ten qualities are similar to space.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་དང་འདྲ་བ་རྣམས་ཡིན་ནོ། །བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་རབ་ཏུ་སིམ་པར་བྱེད་པ་དང་། མཐོང་ན་དགའ་བ་རྣམས་ཡིན། ཆོས་དཀར་པོ་རྣམས་སྐྱེ་བར་བྱེད་པ་དང་། ཆོས་ནག་པོ་རྣམས་བྲི་བར་བྱེད་པ་དང་། རབ་ཏུ་བསྔགས་པ་རྣམས་ཡིན། ལུས་ཡོངས་སུ་དག་པ་རྣམས་ཡིན། བཞོན་པ་མཆོག་ལ་ཞོན་པ་རྣམས་ཡིན། རྟག་ཏུ་བརྒྱན་པ་རྣམས་ཡིན། ཆོས་ཀྱི་དགའ་བ་ལ་མོས་ཤིང་འདུན་པ་རྣམས་ཡིན། འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, bodhisattvas possessing ten qualities are like the moon. What are those ten? They are to gratify the bodies of all beings, to be delightful to behold, to make positive qualities grow, to make negative qualities wane, to be the object of praise, to possess a pure body, to ride a supreme mount, to be constantly adorned, to be interested in and pursue the joy of Dharma, and to have great magical power.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་རབ་ཏུ་སིམ་པར་བྱེད་པ་ནས་ཇི་ལྟར་ན་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བའི་བར་དུ་ཡིན་ཞེ་ན།
en: “You may wonder, noble son, what these qualities may imply, from gratifying the bodies of sentient beings through to having great magical power.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཟླ་བ་ཤར་ན་འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་བསིལ་བ་དང་། ཡིད་དུ་འོང་བས་རབ་ཏུ་སིམ་པར་བྱེད་དོ།
en: “Consider, noble son, the analogy of how the rising moon cools the bodies of sentient beings and gratifies them with its beauty.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཤར་ན་ཡང་འདི་ལྟ་སྟེ། ཉོན་མོངས་པའི་གདུང་བ་ཐམས་ཅད་དང་བྲལ་བ་དང་། དགའ་བ་དང་། དད་པ་དང་། རངས་པ་དང་། ཡིད་དུ་འོང་བས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་རབ་ཏུ་སིམ་པར་བྱེད་དོ།
en: Similarly, when the moon-like bodhisattvas rise they free everyone from all the agony of afflictions and gratify the bodies of all beings with joy, faith, delight, and beauty.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཟླ་བ་ཤར་ན་འདི་ལྟ་སྟེ། ཞི་བ་དང་། དང་བ་དང་། སེམས་ཤིན་ཏུ་དགའ་བར་བྱེད་པས་སེམས་ཅན་ཐམས་ཅད་མཐོང་ན་དགའ་བ་ཡིན་ནོ།
en: “Consider, noble son, how the rising moon brings peace, light, and great joy, so that all beings delight in beholding it.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཤར་ན་ཡང་འདི་ལྟ་སྟེ། དབང་པོ་རྣམ་པར་གསལ་བ་དང་། སེམས་ཀྱི་རྒྱུད་དང་བ་དང་།
en: Similarly, when the moon-like bodhisattvas rise they brighten the faculties and lighten the mind.

source: སྤྱོད་པ་དང་། སྤྱོད་ལམ་དང་། ཡོན་ཏན་ཕུན་སུམ་ཚོགས་པས་སེམས་ཅན་ཐམས་ཅད་མཐོང་ན་དགའ་ཞིང་ཡིད་དུ་འོང་བ་ཡིན་ནོ།
en: Because of their activities, conduct, and excellent qualities, bodhisattvas are beautiful and delightful to behold for all beings.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཟླ་བ་ཡར་གྱི་ངོ་ལ་ཟླ་བ་ཉ་སྟེ།
en: “Consider, noble son, the analogy of the moon during the bright fortnight.

source: རྣམ་པ་ཐམས་ཅད་དུ་རྒྱས་པར་འགྱུར་གྱི་བར་དུ་ཉི་མ་རེ་རེ་ཞིང་འཕེལ་ལོ། །ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Each day it waxes, until it is completely full.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཡང་ཐོག་མ་སེམས་བསྐྱེད་པ་ནས་བཟུང་སྟེ། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་གི་བར་དུ་ཉི་མ་རེ་རེ་ཞིང་ཆོས་དཀར་པོ་རྣམས་འཕེལ་ཞིང་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ། ནམ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་པ་དེ་ན་རྣམ་པ་ཐམས་ཅད་དུ་ཡོངས་སུ་རྫོགས་པ་ཡིན་ནོ།
en: Likewise, from their initial engendering of the mind of awakening until they reside upon the seat of awakening, the virtuous qualities of the moon-like bodhisattvas increase and expand with every passing day until reaching complete fullness when they reside upon the seat of awakening.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཟླ་བ་མར་གྱི་ངོ་ལ་བབ་པ་ན།
en: “Consider, noble son, the analogy of the moon during the dark fortnight.

source: ཟླ་བའི་དཀྱིལ་འཁོར་ཁ་དོག་དང་། སྣང་བ་དང་། ཆུ་ཞེང་ཡང་ཡོངས་སུ་འབྲི་སྟེ། བཅྭ་ལྔ་ལ་ཇི་ལྟར་རྣམ་པ་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་མངོན་པ་དེ་ལྟར་འབྲིའོ།
en: Its colors, light, and size keep waning until the fifteenth day when it completely disappears.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཡང་ནམ་འཇིག་རྟེན་ལས་འདས་པའི་ཡེ་ཤེས་ཐོབ་པར་གྱུར་པ་དེ་ན། དེའི་མི་དགེ་བའི་ཆོས་རྣམས་ཐམས་ཅད་དུ་ཐམས་ཅད་རབ་ཏུ་འབྲི་སྟེ། ཇི་ལྟར་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་ཐམས་ཅད་དུ་ཐམས་ཅད་མེད་པར་འགྱུར་བ་དེ་ལྟར་རབ་ཏུ་འབྲིའོ།
en: Similarly, when the moon-like bodhisattvas attain transcendent wisdom all negative qualities continuously wane until they finally disappear completely at the seat of awakening.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཟླ་བ་ཤར་ན་བྲམ་ཟེ་དང་། རྒྱལ་རིགས་དང་། གྲོང་པ་དང་། ཡུལ་གྱི་མི་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་རྣམས་ཀྱིས་རབ་ཏུ་བསྔགས་པར་བྱ་བ་ཡིན་ནོ།
en: “Consider, noble son, how the rising moon is praised by brahmins, royalty, townspeople, and country dwellers, as well as by women and children.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཤར་ན་ཡང་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་གྱིས་རབ་ཏུ་བསྔགས་པར་བྱ་བ་ཡིན་ནོ།
en: Similarly, when the moon-like bodhisattvas rise they are praised by the world with its gods, humans, demigods, and gandharvas.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ལྷའི་བུ་ཟླ་བའི་ལུས་འདི་ལྟར་
en: “Consider, noble son, the analogy of the god Candra’s body.

source: རང་གི་བསོད་ནམས་ཀྱི་ལས་རྣམ་པར་སྨིན་པས་གྲུབ་པ་ནི་ཡོངས་སུ་དག་སྟེ། རྙོག་པ་མེད་ཅིང་དང་བ་དང་། གསལ་བ་ཡིན་ནོ།
en: Created by the ripening of his own meritorious karma, the body of Candra is completely pure, stainless, bright, and clear.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བའི་ལུས་ཀྱང་འདི་ལྟ་སྟེ། ཆོས་ཉིད་ཀྱིས་མངོན་པར་གྲུབ་པ། རྫུས་ཏེ་སྐྱེས་པ།
en: Similarly, the bodies of moon-like bodhisattvas are established by the intrinsic nature and miraculously born.

source: ཕ་མའི་བཙོག་པ་དང་། མེར་མེར་པོ་ལས་བྱུང་བ་མ་ཡིན་ཏེ།
en: They do not emerge based on the impurities of a father and mother and the various embryonic stages.

source: ཡོངས་སུ་དག་ལ་རྙོག་པ་མེད་ཅིང་དང་བ་དང་གསལ་བ་ཡིན་ནོ།
en: They are completely pure, stainless, bright, and clear.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ལྷའི་བུ་ཟླ་བ་ནི་བཞོན་པ་མཆོག་ལ་ཞོན་ཏེ། གླིང་བཞིར་སྣང་བར་བྱེད་དོ།
en: “Consider, noble son, how the god Candra rides a supreme mount and illumines the four continents.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་མཆོག་ལ་ཞོན་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་མཐའ་ཡས་མུ་མེད་པར་སྣང་བར་བྱེད་དོ།
en: Similarly, the moon-like bodhisattvas ride the supreme Bodhisattva Vehicle and illumine infinite and limitless worlds.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ལྷའི་བུ་ཟླ་བ་ནི་རྟག་ཏུ་བརྒྱན་ཅིང་རྒྱན་མ་རྙིངས་པ་ཡིན་ནོ།
en: “Consider, noble son, how the god Candra is always adorned and never looks shabby.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཡང་འདི་ལྟར་ཡོན་ཏན་གྱི་རྒྱན་རྣམས་ཀྱིས་རྟག་ཏུ་བརྒྱན་པ་ཡིན་ནོ།
en: Similarly, the moon-like bodhisattvas are always adorned with the ornaments of excellent qualities.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ལྷའི་བུ་ཟླ་བ་ནི་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ལྷའི་འདོད་པའི་དགའ་བ་ལ་མོས་པ་ཡིན་ནོ།
en: “Consider, noble son, how the god Candra constantly wishes for and seeks divine pleasure.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཡང་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་ཆོས་ཀྱི་དགའ་བ་ལ་མོས་ཤིང་འདུན་པ་ཡིན་གྱི་འདོད་པས་དགའ་བ་ལ་དགའ་བ་མ་ཡིན་ནོ།
en: Similarly, the moon-like bodhisattvas constantly wish for and seek the joy of the Dharma and have no liking for the pleasures of passion.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ལྷའི་བུ་ཟླ་བ་ནི་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཡིན་ནོ།
en: “Consider, noble son, the god Candra’s possession of great magical power.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་ཡང་འདི་ལྟ་སྟེ། བསོད་ནམས་ཆེན་པོ་དང་། ཡེ་ཤེས་ཆེན་པོས་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བ་ཡིན་ཏེ།
en: Likewise, the moon-like bodhisattvas possess great magical power due to their great merit and great wisdom.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་རབ་ཏུ་སིམ་པར་བྱེད་པ་ནས་འཕྲུལ་ཆེ་ཞིང་མཐུ་ཆེ་བའི་བར་དུ་ཡིན་ནོ།
en: Noble son, from the way they satisfy the bodies of all beings, up to their great magical power, such are bodhisattvas.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཟླ་བ་དང་འདྲ་བ་རྣམས་ཡིན་ནོ།
en: Thus, noble son, bodhisattvas who possess these ten qualities are like the moon.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་ན་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་དང་འདྲ་བ་རྣམས་ཡིན་ནོ།
en: “Noble son, because they possess ten qualities bodhisattvas are like the sun.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མ་རིག་པའི་མུན་པ་སེལ་བ་རྣམས་ཡིན། འདུལ་བའི་སེམས་ཅན་རྣམ་པར་འབྱེད་པར་བྱེད་པ་རྣམས་ཡིན། ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་ལྷན་ནེར་བྱེད་པ་རྣམས་ཡིན། དགེ་བའི་ཆོས་མངོན་པར་ཤར་བ་རྣམས་ཡིན། དེ་དག་གི་ཟག་པ་ནུབ་པར་འགྱུར་བ་རྣམས་ཡིན། སྣང་བར་བྱེད་པ་རྣམས་ཡིན། མུ་སྟེགས་ཅན་ངན་པའི་ལུགས་རྣམས་ཟིལ་གྱིས་མནན་ཏེ་འདུག་པ་རྣམས་ཡིན། མཉམ་པ་དང་མི་མཉམ་པ་ཀུན་སྟོན་པ་རྣམས་ཡིན། ཆོས་དཀར་པོའི་ལས་ཀྱི་མཐའ་ཐམས་ཅད་འབྱུང་བར་བྱེད་པ་རྣམས་ཡིན། སྐྱེ་བོ་དགེ་བ་དགའ་བ་རྣམས་ཡིན་ནོ།
en: What are those ten? They dispel the darkness of ignorance, mature those who are to be trained, shine in the ten directions, manifest virtuous qualities, cause the fading of defilements, spread light, subdue the unwholesome ways of the non-Buddhists, reveal the equal and the unequal, manifest all wholesome means of livelihood, and are the joy of virtuous beings.

source: རིགས་ཀྱི་བུ་དེ་ལ་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་མ་རིག་པའི་མུན་པ་སེལ་བ་ནས། ཇི་ལྟར་སྐྱེ་བོ་དགེ་བ་དགའ་བའི་བར་དུ་ཡིན་ཞེ་ན།
en: “You may wonder, noble son, what these qualities may imply, from the bodhisattvas’ dispelling of the darkness of ignorance through to their being the joy of virtuous beings.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་ན་མུན་པ་མུན་ནག་ཐམས་ཅད་རྣམ་པར་སེལ་ཏོ།
en: “Consider, noble son, the analogy of the sun that rises to dispel all pitch-black darkness.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་ཤར་ན་ཡང་མ་རིག་པའི་མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་ཏོ།
en: Similarly, when the sun-like bodhisattvas rise they dispel all the darkness of ignorance.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་ན་པད་མ་རྣམ་པར་འབྱེ་བར་བྱེད་དོ།
en: “Consider, noble son, the analogy of the sun that makes the lotus flowers unfold.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་ཤར་ན་ཡང་གདུལ་བའི་སེམས་ཅན་གྱི་པད་མ་རྣམ་པར་འབྱེ་བར་བྱེད་དོ།
en: Similarly, when the sun-like bodhisattvas rise they unfold the lotus flowers of the beings who need training.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་ན་ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་ལྷན་ནེར་བྱེད་དོ།
en: “Consider, noble son, the analogy of the sun that rises to shine in all the ten directions.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་ཤར་ན་ཡང་ཕྱོགས་བཅུ་ཐམས་ཅད་དུ་ཤེས་རབ་ཀྱི་གཟི་བརྗིད་དང་། ཡེ་ཤེས་ཀྱི་འོད་ཟེར་གྱིས་རབ་ཏུ་ལྷན་ནེར་བྱེད་ཀྱང་སེམས་ཅན་རྣམས་ལ་གནོད་པར་མི་འགྱུར་རོ།
en: Similarly, when the sun-like bodhisattvas rise they shine brightly with the splendor of insight and the light of wisdom, without ever causing any harm to sentient beings.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་འཛམ་བུའི་གླིང་དུ་ཉི་མའི་འོད་ཟེར་དག་ནམ་སྣང་བ་དེའི་ཚེ་ན་ཤར་ཅེས་བྱའོ།
en: “Consider, noble son, how the time when the sun’s rays appear is referred to as the sunrise

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མའི་ཡེ་ཤེས་ཀྱི་འོད་ཟེར་རྣམས་ནམ་སྣང་བ་དེའི་ཚེ་ན་དགེ་བའི་ཆོས་རྣམས་ཤར་ཅེས་བྱའོ།
en: Similarly, when the wisdom light of the sun-like bodhisattvas appears, that time is referred to as the rise of virtuous qualities

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་འཛམ་བུའི་གླིང་དུ་ཉི་མའི་སྣང་བ་ནམ་མེད་པར་གྱུར་པ་དེའི་ཚེ་ན་ནུབ་ཅེས་བྱའོ།
en: “Consider, noble son, how the time when the light of the sun disappears is referred to as the sunset

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉེ་བའི་ཉོན་མོངས་པ་རྣམས་ཐམས་ཅད་དུ་ཐམས་ཅད་ནམ་མེད་པར་གྱུར་པ་དེའི་ཚེ་ན་ཟག་པ་ཟད་ཅེས་བྱའོ།
en: Similarly, for the bodhisattvas, when all the afflictions entirely disappear that time is referred to as the exhaustion of defilement

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་ན་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་རྣམས་ལ་སྣང་བར་བྱེད་དོ།
en: “Consider, noble son, how the sun rises to shine on all beings in Jambu­dvīpa.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་ཤར་ན་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཀྱི་སྣང་བ་བྱེད་ཅིང་། གཏི་མུག་གི་མུན་པའི་རབ་རིབ་ཀྱིས་ཁེབས་པ་རྣམ་པར་སེལ་ཏོ།
en: Similarly, when the sun-like bodhisattvas rise they bring the light of wisdom to all beings, clearing away all the veils of the darkness of dullness.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་ན་འོད་ཐམས་ཅད་ཀྱི་འོད་མེད་པར་བྱེད་ཀྱང་ཉི་མ་ནི་
en: “Consider, noble son, how the radiant sun outshines all other lights.

source: ངས་འོད་ཐམས་ཅད་ཀྱི་འོད་མི་སྣང་བར་བྱའོ་སྙམ་དུ་མི་སེམས་མོད་ཀྱི། འོན་ཀྱང་ཆོས་ཉིད་ཐོབ་པས་འོད་མེད་པར་འགྱུར་རོ།
en: Although the sun does not think, ‘I shall dim them,’ it nevertheless happens by the power of its intrinsic nature.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་ཤར་ན་ཡང་མུ་སྟེགས་ཅན་ངན་པའི་འོད་དང་། མུ་སྟེགས་ཅན་ངན་པའི་ལུགས་ཐམས་ཅད་འོད་མེད་པར་འགྱུར་མོད་ཀྱི།
en: Similarly, when the sun-like bodhisattvas shine, the lights of evil non-Buddhists and the light of evil non-Buddhist systems all disappear.

source: བྱང་ཆུབ་སེམས་དཔའི་ཉི་མ་ནི་ངས་འདི་དག་འོད་མེད་པར་བྱའོ་སྙམ་དུ་མི་སེམས་མོད་ཀྱི། འོན་ཀྱང་ཆོས་ཉིད་ཐོབ་པས་འོད་མེད་པར་འགྱུར་རོ།
en: Although the sun-like bodhisattvas do not think, ‘I shall outshine them,’ it nevertheless happens by the power of the intrinsic nature.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་ན་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ལ་མཉམ་པ་དང་མི་མཉམ་པ་ལེགས་པར་སྟོན་ཏོ།
en: “Consider, noble son, how the shining sun clearly reveals both the equal and the unequal to the people of Jambu­dvīpa.

source: དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་ཉི་མ་ཤར་ན་ཡང་སེམས་ཅན་ཐམས་ཅད་ལ་ཡེ་ཤེས་ཀྱི་སྣང་བས་མཉམ་པ་དང་། མི་མཉམ་པ་ལེགས་པར་སྟོན་ཏོ།
en: The sun-like bodhisattvas, similarly, shine with the light of awareness to reveal the equal and the unequal clearly for sentient beings.

source: རིགས་ཀྱི་བུ་མཉམ་པ་ཞེས་བྱ་བ་འདི་ནི་འཕགས་པའི་ལམ་གྱི་ཚིག་བླ་དགས་སོ། །རིགས་ཀྱི་བུ་མི་མཉམ་པ་ཞེས་བྱ་བ་འདི་ནི་ལམ་ངན་པའི་ཚིག་བླ་དགས་སོ།
en: Noble son, the equal refers to the path of the noble ones while, noble son, the unequal refers to the inferior paths.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་ཉི་མ་ཤར་ན་རྨོ་བརྐོ་བའི་ལས་ཀྱི་མཐའ་ཐམས་ཅད་འབྱུང་ངོ་།
en: “Noble son, when the sun shines, all sorts of agricultural activities become possible.
